[
    {
        "id": 1,
        "titleL": "React JS",
        "descriptionL": "I use React in almost every project that I make. I know how React works, the syntax JSX, and always writing reusable components. I understand how hooks work, and how to write class components and functional components. I know how conditional rendering, props, and event works. I use npm in all projects.",
        "titleR": "JavaScript",
        "descriptionR": "Strong fundamentals in JavaScript. Knowledge in basics concepts scope, hoisting, variables, and immediately invoked function expression (IIFE). Working with functions, closures, callback functions, async-await functions, and arrow functions. Arrays, objects, promises, classes, DOM manipulation."
    },
    {
        "id": 2,
        "titleL": "APIs REST",
        "descriptionL": "I did a lot of projects working with API REST. I know how to connect with an external API and consume that data in my project. I know the basics of AJAX and HTTP protocol. I use the Axios library when I have to work with APIs. I’m currently learning how to create an API.",
        "titleR": "GIT",
        "descriptionR": "I use GIT as my control system. I know the most frequent features in GIT, how to create and clone a repository, initialize a project in a remote repository, and how to pull and push archives. I use the terminal and de VScode GIT option."
    },
    {
        "id": 3,
        "titleL": "HTML",
        "descriptionL": "I have strong proficiency in HTML. I have more than 3 years of experience with it. I write clean tag architecture mixing semantic and non-semantic tags. I always think of the bigger project, and then I break it down into smaller components, and then I work on every component. Experience with forms, inputs, and SEO.",
        "titleR": "CSS",
        "descriptionR": "I don’t usually work with pure CSS, I use the preprocessor SASS which allows me to write styling code faster. I know the concepts of box-model, grid system and flexbox, units and position. I work with animation keyframes. And sometimes I use libraries for styling."
    },
    {
        "id": 4,
        "titleL": "Responsive Design",
        "descriptionL": "All of my projects are based on responsive design. I know the concepts of mobile-first and pixel-perfect. I start my projects in desktop design and then add media queries in order to get a responsive design.",
        "titleR": "Bootstrap",
        "descriptionR": "I work with Bootstrap when I have to do a simple design in a short time. I use Bootstrap with basic components, such as forms, galleries, spinners, and buttons. I use Bootstrap with React, and I can do entire projects."
    },
    {
        "id": 5,
        "titleL": "Figma",
        "descriptionL": "I use Figma when I have to design a website. The first thing I do is translate my thoughts into paper and then I work in Figma. When the Figma file is done I start coding in the real project.",
        "titleR": "GitHub",
        "descriptionR": "I use GitHub as my code repository. I have all of my projects and every day I’m working on something so I work every day with GIT and GitHub. I use GitHub pages to host some of my projects."
    }
]